# ileri birleştirme işlemleri

In [1]:
import pandas as pd

In [2]:
#birebir birleştirme:tüm elemanların iki veri setinde de birebir yer alması durumudur

In [6]:
df1 = pd.DataFrame({"calisanlar": ["ali","veli","ayse","fatma"],
                   "grup": ["muhasebe","mühendislik","mühendislik","ik"]})
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  mühendislik
2       ayse  mühendislik
3      fatma           ik

In [7]:
df2 = pd.DataFrame({"calisanlar": ["ali","veli","ayse","fatma"],
                   "ilk_giris": [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        ali       2010
1       veli       2009
2       ayse       2014
3      fatma       2019

In [8]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [9]:
pd.merge(df1, df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [10]:
#coktan teke

In [11]:
df3 = pd.merge(df1, df2)
df3

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [14]:
df4 = pd.DataFrame({"grup": ["muhasebe","mühendislik","ik"],
                    "mudur": ["asım","berkcan","sude"]})
df4

          grup    mudur
0     muhasebe     asım
1  mühendislik  berkcan
2           ik     sude

In [15]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        ali     muhasebe       2010     asım
1       veli  mühendislik       2009  berkcan
2       ayse  mühendislik       2014  berkcan
3      fatma           ik       2019     sude

In [16]:
#coktan coka

In [17]:
df5 = pd.DataFrame({"grup": ["muhasebe","muhasebe","mühendislik","mühendislik","ik","ik"],
                    "yetenekler": ["matematik","excel","kodlama","linux","excel","yönetim"]})
df5

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  mühendislik    kodlama
3  mühendislik      linux
4           ik      excel
5           ik    yönetim

In [18]:
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  mühendislik
2       ayse  mühendislik
3      fatma           ik

In [19]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        ali     muhasebe  matematik
1        ali     muhasebe      excel
2       veli  mühendislik    kodlama
3       veli  mühendislik      linux
4       ayse  mühendislik    kodlama
5       ayse  mühendislik      linux
6      fatma           ik      excel
7      fatma           ik    yönetim